const discordRulesData = {
    // المفتاح الرئيسي الذي سيتم استدعاؤه من القائمة الرئيسية
    'discord-main': {
        title: "📱 قـوانين الـدسكورد",
        text: `<div class="rules-section">
            .1 - ( يمنع السب والقذف واللعن )<br><br>
            .2 - ( يمنع نشر أي سيرفر يتعلق بالفايف إم )<br><br>
            .3 - ( يمنع نشر أي رابط يتعلق بمتاجر أو مواقع أو مجتمعات )<br><br>
            .4 - ( يمنع استخدام رياكشنات مسيئة )<br><br>
            .5 - ( يمنع وضع أسماء أو صور مسيئة أو خادشة للحياء والذوق العام )<br><br>
            .6 - ( يمنع إرسال صور أو مقاطع مخلة بالآداب العامة )<br><br>
            .7 - ( يمنع الاستهزاء والسخرية من الآخرين )<br><br>
            .8 - ( يمنع العنصرية وسب الأديان أو القبائل )<br><br>
            .9 - ( يمنع إزعاج الإداريين )<br><br>
            .10 - ( يمنع نشر معلوماتك الشخصية واتس اب، سناب... الخ )<br><br>
            .11 - ( احترام جميع الموجودين )<br><br>
            .12 - ( عدم التكلم بالأمور السياسية والدينية )<br><br>
            .13 - ( يمنع استفزاز الأعضاء والإدارة )<br><br>
            .14 - ( يمنع مضايقة اللاعبين في الرومات الصوتية )<br><br>
            .15 - ( يمنع إزعاج الإدارة بتكرار المنشن )<br><br>
            .16 - ( الجدية في روم المزاد )<br><br>
            
            <hr style="border: 0.5px solid #444; margin: 20px 0;">
            <p style="text-align: center; color: #ff0000; font-weight: bold;">
                # مخالفة أي من القوانين الموضحة قد يعرضك إلى باند نهائي لذا يرجى من الجميع الالتزام بالقوانين الموضحة أعلاه.
            </p>
        </div>`
    }
};
