const rulesData = {
    'city-rules': {
        title: "قوانين المدينة 🏙️",
        text: `
            <div class="grid-container">
                <div class="card sub-card" onclick="showContent('city-terms')">تعريف بعض المصطلحات ⤥</div>
                <div class="card sub-card" onclick="showContent('ban-cases')">حالات تعرضك للباند النهائي ⤥</div>
                <div class="card sub-card" onclick="showContent('chat-rules-detail')">قوانين شات اللعبة ⤥</div>
                <div class="card sub-card" onclick="showContent('admin-requests')">قوانين طلب الإداريين ⤥</div>
                <div class="card sub-card" onclick="showContent('kidnap-loot')">قوانين الخطف والتلويت ⤥</div>
                <div class="card sub-card" onclick="showContent('general-city-rules')">قوانين عامة ⤥</div>
            </div>`
    },

    'ministry-main': {
        title: "👑 قـوانين الـوزارات",
        text: `
            <div class="grid-container">
                <div class="card sub-card" onclick="showContent('min-system')">النظام الوزاري ⤥</div>
                <div class="card sub-card" onclick="showContent('civil-system')">النظام المدني ⤥</div>
                <div class="card sub-card" onclick="showContent('state-const')">دستور الدولة ⤥</div>
                <div class="card sub-card" onclick="showContent('immunity')">الحصانات ⤥</div>
                <div class="card sub-card" onclick="showContent('public-security')">الامن العام ⤥</div>
                <div class="card sub-card" onclick="showContent('royal-guard')">الحرس الملكي ⤥</div>
                <div class="card sub-card" onclick="showContent('health-min')">وزارة الصحة ⤥</div>
                <div class="card sub-card" onclick="showContent('radio-protocol')">بروتوكولات الراديو ⤥</div>
            </div>`
    },

    'discord-rules': {
        title: "قوانين الدسكورد 📱",
        text: `<div class="rules-section">
            1 - ( يمنع السب والقذف واللعن )<br>
            2 - ( يمنع نشر أي سيرفر يتعلق بالفايف إم )<br>
            3 - ( يمنع نشر أي رابط يتعلق بمتاجر أو مواقع أو مجتمعات )<br>
            4 - ( يمنع استخدام رياكشنات مسيئة )<br>
            5 - ( يمنع وضع أسماء أو صور مسيئة أو خادشة للحياء والذوق العام )<br>
            6 - ( يمنع إرسال صور أو مقاطع مخلة بالآداب العامة )<br>
            7 - ( يمنع الاستهزاء والسخرية من الآخرين )<br>
            8 - ( يمنع العنصرية وسب الأديان أو القبائل )<br>
            9 - ( يمنع إزعاج الإداريين )<br>
            10 - ( يمنع نشر معلوماتك الشخصية واتس اب، سناب... الخ )<br>
            11 - ( احترام جميع الموجودين )<br>
            12 - ( عدم التكلم بالأمور السياسية والدينية )<br>
            13 - ( يمنع استفزاز الأعضاء والإدارة )<br>
            14 - ( يمنع مضايقة اللاعبين في الرومات الصوتية )<br>
            15 - ( يمنع إزعاج الإدارة بتكرار المنشن )<br>
            16 - ( الجدية في روم المزاد )<br>
            <hr>
            <p style="text-align: center; color: red;"><b># مخالفة أي من القوانين الموضحة قد يعرضك إلى باند نهائي لذا يرجى من الجميع الالتزام بالقوانين الموضحة أعلاه.</b></p>
        </div>`
    },

    'gang-rules': {
        title: "قوانين المنظمات والعصابات 🔪",
        text: `<div class="rules-section">
            .1 - يمنع ارتداء أو استعمال اي خوذة اثناء مشاركتك في أي سيناريو أو فايت<br><br>
            .1 - على جميع أفراد المنظمات والعصابات الالتزام بقوانين السيرفر وقوانين السيناريوهات، مخالفة إحدى القوانين يعرض الشخص والعصابة للمحاسبة.<br><br>
            .2 - تعتبر مقرات المنظمات والعصابات مناطق غير آمنة للعساكر والمواطنين ويسمح بقتلهم وتلويتهم أو خطفهم، باستثناء المسعفين والإداريين المطلوبين بـ تيكت.<br><br>
            .3 - يجب الالتزام بالرول بلاي.<br><br>
            .4 - يمنع التحالف مع منظمة أو عصابة ضد منظمة أو عصابة دون اتفاق من قبل مسؤولين العصابات.<br><br>
            .5 - يحق للمنظمة فتح مزاد على الرهائن بمختلف فئاتهم.<br><br>
            .6 - المنظمات فقط هي المسؤولة عن الإجرام في المدينة وهي المصدرة للأسلحة والممنوعات والمركبات والمدرعات.<br><br>
            .7 - جميع السلع التي تباع بالمنظمة محدد سعرها، ويمنع التفاوض على السعر.<br><br>
            .8 - لا يوجد تعويض على الأسلحة والمركبات عند فقدانها أو سوء استخدامها.<br><br>
            .9 - يمنع مداهمة المنظمات في حال فتح الأسواق، ويسمح لك بذلك بعد إغلاق الأسواق بـ 15 دقيقة.<br><br>
            .10 - يجب على الجميع الخوف على حياتهم عند دخولهم للمنظمات.<br><br>
            .11 - أي مواطن يدخل السوق السوداء وبيده سلاح يقتل فورًا بدون تهديد.<br><br>
            .12 - يحق لأعضاء المنظمات عند فتح السوق قتل أي شخص لا يلتزم بالقوانين.<br><br>
            .13 - يحق فتح سوق المنظمات في حال وجود 5 من أعضاء المنظمات.<br><br>
            .14 - إخراج المدرعات والأسلحة بدون سبب وأخذ أسلحة بكميات هائلة يعرض المنظمة أو العصابة للإنذار ويعرض العضو للفصل.<br><br>
            .15 - إعطاء المواطنين أو العساكر أسلحة من العصابات يعرضها للمحاسبة والانذار، حيث أن المنظمات هي المسؤولة عن البيع فقط.<br><br>
            .16 - يمنع على جميع القطاعات العسكرية مداهمة المنظمات/العصابات بدون إعلان مسبق ويشترط قبوله.<br><br>
            .17 - يمنع إنعاش أي شخص في مقرات المنظمات/العصابات باستثناء أعضاء المنظمة/العصابة.<br><br>
            .18 - يمنع منعا باتا تبادل النار مع عسكري في المناطق الآمنة.<br><br>
            .19 - يمنع استخدام صلاحيات المنظمة والعصابة مثل الكلبشة داخل المدينة، وأي استخدام خاطئ للصلاحيات يعرضك للمحاسبة.<br><br>
            .20 - العصابة غير المتفاعلة لمدة 5 أيام تحصل على تحذير، واستمرار عدم التفاعل يؤدي إلى إغلاقها.<br><br>
            .21 - يسمح بقتل أي شخص يدخل مقر العصابة أو المنظمة (في حال إغلاق السوق فقط للمنظمات).<br><br>
            .22 - أي مشاكل أخلاقية أو عنصرية أو شخصنة بين أفراد العصابة أو مع العصابات الأخرى تؤدي لعقوبات صارمة تصل إلى إغلاق العصابة.<br><br>
            .23 - في حالة وجود مخالفة في سيناريو يمنع طلب إداري في منتصف السيناريو ويسمح لك بعد انتهاء السيناريو التوجه لمراقب السيناريو.<br><br>
            .24 - يمنع على المواطنين والعساكر المشاركة في سيناريوهات مع عصابة/منظمة.<br><br>
            .25 - يجب قبول المداهمة عند وجود 5 من أعضاء عصابة/منظمة.<br><br>
            .26 - يمنع استخدام كلمات تدل على الاستفزاز مثل: ابلع، نوب، بوت، جلد، شق، دعس، القم، ايزي، إلى آخره من الكلام الاستفزازي.<br><br>
            .27 - القتل خارج المناطق الآمنة دون تهديد وإنما قتل فوري.<br><br>
            .28 - يجب على جميع أعضاء المنظمة/العصابة تقمص شخصية رجل العصابة والأعمال الإجرامية بكل احترافية.<br><br>
            .29 - يمنع إعطاء أي شخص جديد على العصابة مسؤوليات إلا بعد مرور 10 أيام على الأقل، أو اجتياز نقاط وشروط التفاعل المحددة من القانق مانجر.<br><br>
            .30 - يجب على العصابة الالتزام بملابس موحدة يتم تحديدها من قبل رئيس العصابة.<br><br>
            .31 - يجب الالتزام بالصف أثناء السيناريوهات، أي فوضى تعرض الشخص والمنظمة/العصابة للمحاسبة.<br><br>
            .32 - يمنع استخدام الخواص الإدارية، وفي حال استخدام أي خواص إدارية أثناء السيناريوهات تتعرض للمحاسبة المشددة.<br><br>
            .33 - يجب الالتزام بتعليمات وتوجيهات القانق مانجر.<br><br>
            .34 - يجب الالتزام التام بالرول بلاي أثناء التفاوض وتقمص الشخصية الإجرامية بشكل كامل ووضع أسباب إجرامية مقنعة للعملية (يمنع استخدام: سطاوة – قدحة – فاضين – الخ).<br><br>
            .35 - المخالفات من رتبة قانق أوفشل وأعلى تعرض الشخص والمنظمة/العصابة بشكل كامل للمحاسبة.<br><br>
            .36 - يمنع على المنظمات/العصابات استخدام الطيارات إلا في حال وجود سيناريو متفق عليه.<br><br>
            .37 - يمنع استخدام أصدقائك في إيهام العساكر بأنهم رهائن.<br><br>
            .38 - يسمح ببيع الرهائن في سوق المنظمات.<br><br>
            .39 - مقرات المنظمات/العصابات آمنة لهم ولا يحق لأي أحد قتلهم فيها بدون إعلان مداهمة، ويمنع تلويتهم في مقراتهم.<br><br>
            <hr>
            <p style="text-align: center; color: #6A0DAD; font-weight: bold;"># القوانين قابلة للمراجعة والتعديل باستمرار فعليك متابعتها، وجهلك بالنظام لا يعفي من العقوبة.</p>
        </div>`
    }
};

function showContent(key) {
    const data = rulesData[key];
    if (!data) return;
    document.getElementById('main-view').classList.add('hidden');
    document.getElementById('content-view').classList.remove('hidden');
    document.getElementById('content-title').innerText = data.title;
    document.getElementById('content-text').innerHTML = data.text;
    window.scrollTo(0,0);
}

function showMain() {
    document.getElementById('content-view').classList.add('hidden');
    document.getElementById('main-view').classList.remove('hidden');
}
